; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-74)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b16)
    (on b16 b13)
    (on b13 b1)
    (on b1 b20)
    (on b20 b9)
    (on b9 b3)
    (on b3 b17)
    (on b17 b22)
    (on b22 b6)
    (on b6 b14)
    (on b14 b8)
    (on b8 b5)
    (on b5 b4)
    (on b4 b10)
    (on b10 b21)
    (on b21 b2)
    (on b2 b15)
    (on b15 b12)
    (on b12 b18)
    (on b18 b7)
    (on b7 b19)
    (on-table b19))
 (:goal (and 
(on-table b19)
(on-table b13)
))
)

; plan
1. (unstack b11 b16)
   deleted: (on b11 b16) (clear b11) (arm-empty)
   added: (holding b11) (clear b16)
   goals met: 1 of 2
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 2
3. (unstack b16 b13)
   deleted: (on b16 b13) (clear b16) (arm-empty)
   added: (holding b16) (clear b13)
   goals met: 1 of 2
4. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 2
5. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 1 of 2
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 2
